In [3]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [5]:
# Create a dataframe

data = pd.DataFrame({"Name": ['Katelyn', 'Sarah', 'Adrian', 'Heather', 'Alan', 'Jade'],
                     "Gender": ['F','F','M','F','M','NB'],
                     "Age": [36,31,45,43,40,31]})

In [6]:
data

      Name Gender  Age
0  Katelyn      F   36
1    Sarah      F   31
2   Adrian      M   45
3  Heather      F   43
4     Alan      M   40
5     Jade     NB   31

In [12]:
# Use a lambda function to calculate year of birth

yob = lambda x: 2025-x
yob(data['Age'])

0    1989
1    1994
2    1980
3    1982
4    1985
5    1994
Name: Age, dtype: int64

In [13]:
# Add Year_of_Birth column to the dataframe

data['Year_of_Birth']=yob(data['Age'])

data

      Name Gender  Age  Year_of_Birth           Name_length
0  Katelyn      F   36           1989   more than 5 letters
1    Sarah      F   31           1994             5 letters
2   Adrian      M   45           1980   more than 5 letters
3  Heather      F   43           1982   more than 5 letters
4     Alan      M   40           1985  fewer than 5 letters
5     Jade     NB   31           1994  fewer than 5 letters

In [15]:
# Create a flag column from the a text column using lambda and apply

# The flag column here tells whether the name has fewer than 5, exactly 5 or more than 5 letters

data['Name_length'] = data['Name'].apply(
    lambda x:'fewer than 5 letters' if len(x)<5 else ('more than 5 letters' if len(x)>5 else '5 letters'))

data

      Name Gender  Age  Year_of_Birth           Name_length
0  Katelyn      F   36           1989   more than 5 letters
1    Sarah      F   31           1994             5 letters
2   Adrian      M   45           1980   more than 5 letters
3  Heather      F   43           1982   more than 5 letters
4     Alan      M   40           1985  fewer than 5 letters
5     Jade     NB   31           1994  fewer than 5 letters